{
  "profile": {
    "overview": {
      "name": "Mateusz Majchrzak",
      "title": "Senior software engineer",
      "mail": "majchrzak@outlook.com",
      "phone": "(+48) 508 387 828",
      "location": "Warsaw, Poland",
      "github": "github.com/majchrzak",
      "linkedin": "linkedin.com/in/m-majchrzak"
    },

    "about": "I'm a software engineer with nine years of professional experience in software development. Most recently, I'm focusing on web development, especially in the finance field. I worked for many diverse software companies from early-stage startups to large companies like BNP Paribas or Pfizer. My leading programming language is C#, but constantly expanding my knowledge to TypeScript. I'm also an active open source contributor focusing to deliver high-quality software to the community.",

    "experience": [
      {
        "role": ".NET Senior Developer",
        "company": "C&F S.A.",
        "location": "(remote)",
        "summary": "",
        "period": "2021 - present",
        "responsibilities": [
          "Took a part in the development of microservice backend application in C# to coordinate and manage a work of all business units in Pfizer;",
          "Developed a frontend application in Angular and TypeScript to visualize and optimize a production of components in Pfizer;"
        ]
      },
      {
        "role": ".NET Senior Developer",
        "company": "ITMAGINATION  sp. z o.o.",
        "location": "(remote)",
        "summary": "",
        "period": "2018 - 2021",
        "responsibilities": [
          "Architected and developed an Azure-hosted SaaS client scoring application in C#; developed frontend application in Angular and TypeScript; created and managed build pipelines and IaC in Terraform;",
          "Architected and developed an algorithmic trading application for cryptocurrency markets in C#; integrated Python language into .NET web application; designed and developed market neutral strategies; worked closely with data scientists to improve performance of existing strategies; automated testing and deployment in Azure DevOps and AWS;",
          "Developed Know Your Customer microservice application for BNP Paribas in C# which automates verifying the identity of clients and assessing potential risks of illegal intentions for the business relationship; developed frontend application in Angular and TypeScript; worked closely with business analysts and scrum master to meet requirements;"
        ]
      },
      {
        "role": ".NET/C++ Senior Developer",
        "company": "Order Group sp. z o.o.",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2016 - 2018",
        "responsibilities": [
          "Architected and developed a mobile application for iOS and Windows that serves a navigation aid for both helicopter and aircraft pilots during all kinds of flight operations in C#; worked with clients to provide best solutions and validate requirements; optimized memory and CPU/GPU performance to improve device stability and battery life; adopted and extended Tangram-ES map rendering library in C++;",
          "Developed application in C# that manages and synchronizes user receipts for SKANSKA; implemented receipt OCR data recognition; developed user interface based on provided mockups;"
        ]
      },
      {
        "role": ".NET Regular Developer",
        "company": "Freelance",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2015 - 2016",
        "responsibilities": [
          "Built Android client for online distribution marketplace in Kotlin/Java; designed and developed user interface based on desktop mockups;",
          "Designed and developed mobile advertise application in Kotlin and Swift to promote company leading project;"
        ]
      },
      {
        "role": ".NET Regular Developer",
        "company": "Fuero Games sp. z o.o.",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2014 - 2015",
        "responsibilities": [
          "Developed cross-platform MMO strategy game for iOS, Android, and Facebook in C#; worked closely with backend team to met requirements; optimized network performance based on prediction and request batching; implemented number of external payment providers like Xsolla, Google Play and App Store;",
          "Developed a PoC of multiplayer third-person desktop shooter in C# for a Wargaming; developed network synchronization and replication components;"
        ]
      },
      {
        "role": ".NET/C++ Developer",
        "company": "Nitreal",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2013 - 2014",
        "responsibilities": [
          "Developed game converter to convert games from Torque Engine into Unity 3D in C#; ported a series of time management strategy games from PC to mobile;",
          "Took a part in the development of VR application for large-area stores; developed a heatmap system to track client eyes in C++;",
          "Created game framework in JavaScript and HTML5 (Canvas); developed over 20 simple educational games based on this framework;"
        ]
      }
    ],

    "contribution": [
      {
        "period": "2022 - present",
        "url": "pepperoni.finance",
        "responsibilities": [
          "Created a Web 3.0 project to rebalance in easy way a portfolio of assets in Ethereum blockchain; the project is based on Uniswap protocol and a design of application is highly inspired by Uniswap App; the project is currently in development phase and is not yet ready for use; the solution is powered by Next.js, React and is hosted on Vercel;"
        ]
      },
      {
        "period": "2017 - present",
        "url": "quantform.io",
        "responsibilities": [
          "Created an open-source Node.js library for building reactive algorithmic trading strategies for cryptocurrencies based on RxJS in TypeScript; designed a declarative uniform interface for centralized and decentralized exchanges; created a web tool to trace and visualize strategy execution in React and Next.js; built a command-line interface automate development and manage execution; created a documentation and landing page for project;"
        ]
      },
      {
        "period": "2016 - 2017",
        "summary": "startup",
        "responsibilities": [
          "Developed first-class secure messaging mobile application in Kotlin; designed and created a communication protocol built on top of Bitcoin blockchain; implemented end-to-end data encryption; developed hierarchical deterministic Bitcoin wallet;"
        ]
      },
      {
        "period": "2015 - 2016",
        "url": "github.com/majchrzak/flurry-unity-3d",
        "responsibilities": [
          "Created a Yahoo Flurry Analytics plugin for Unity 3D in C#, Java, and Objective-C; get listed as a third-party provider on official Yahoo documentation;"
        ]
      },
      {
        "period": "2014 - 2015",
        "url": "github.com/majchrzak/storekit-unity-3d",
        "responsibilities": [
          "Developed Apple StoreKit plugin for Unity 3D in C# and Objective-C;"
        ]
      }
    ],

    "certification": [],

    "skills": [
      "DDD",
      "TDD",
      "C#",
      ".NET Core",
      ".NET Framework",
      "ASP.NET Core",
      "Xamarin",
      "Unity 3D",
      "Node.js",
      "React",
      "Angular 2",
      "Next.js",
      "TypeScript",
      "CSS",
      "Tailwind CSS",
      "HTML",
      "Bootstrap",
      "RxJS",
      "OpenAPI",
      "Swagger",
      "SQL Server",
      "SQLite",
      "Docker",
      "Terraform",
      "AWS",
      "Azure DevOps",
      "RabbitMQ",
      "Visual Studio",
      "VSCode",
      "Rider",
      "Windows",
      "macOS",
      "Git",
      "SCRUM"
    ],

    "language": [
      {
        "name": "Polish",
        "summary": "Native proficiency"
      },
      {
        "name": "English",
        "summary": "Upper-intermediate proficiency"
      }
    ],

    "clause": "I agree to the processing of personal data provided in this document for realising the recruitment process pursuant to the Personal Data Protection Act of 10 May 2018 (Journal of Laws 2018, item 1000) and in agreement with Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation)"
  }
}
