{
  "profile": {
    "overview": {
      "name": "Mateusz Majchrzak",
      "title": "Senior software engineer",
      "mail": "majchrzak@outlook.com",
      "phone": "(+48) 508 387 828",
      "location": "Warsaw, Poland",
      "github": "github.com/majchrzak",
      "linkedin": "linkedin.com/in/m-majchrzak"
    },
    "about": "I'm a senior software engineer with ten eleven of professional experience in software development. Most recently, I'm focusing on web development, especially in the finance field. I worked for many diverse software companies from early-stage startups to large companies like Ramp.Network, BNP Paribas or Pfizer. My leading programming languages are TypeScript and C#, but constantly expanding my knowledge to Rust. I'm also an active open source contributor focusing to deliver high-quality software to the community.",
    "experience": [
      {
        "role": "SENIOR SOFTWARE ENGINEER (TYPESCRIPT)",
        "company": "Ramp Network sp. z o.o.",
        "location": "(remote)",
        "summary": "",
        "period": "2022 - present",
        "responsibilities": [
          "Contributed to the development of on-ramp and off-ramp products for exchanging cryptocurrencies for fiat money using Node.js. Focused on the Risk and Compliance segment to ensure compliance with legal requirements and to provide a fast and efficient verification process for both new and existing users."
        ]
      },
      {
        "role": "SENIOR SOFTWARE ENGINEER (C#/TYPESCRIPT)",
        "company": "C&F S.A.",
        "location": "(remote)",
        "summary": "",
        "period": "2021 - 2022",
        "responsibilities": [
          "Participated in the development of a microservice backend application using C# to coordinate and manage the workflow of all production units in Pfizer. This involved collaborating closely with the product owner and other team members to ensure timely delivery and high-quality code.",
          "Developed a frontend application in Angular and TypeScript for Pfizer that visualizes and optimizes the production of components, providing an efficient and streamlined production process for the company."
        ]
      },
      {
        "role": "SENIOR SOFTWARE ENGINEER (C#/TYPESCRIPT)",
        "company": "ITMAGINATION  sp. z o.o.",
        "location": "(remote)",
        "summary": "",
        "period": "2018 - 2021",
        "responsibilities": [
          "Architected a C# algorithmic trading app for cryptocurrencies, integrating Python into a .NET web application. Collaborated with data scientists to enhance strategy performance and automated testing and deployment using Azure DevOps and AWS.",
          "Developed a KYC microservice for BNP Paribas in C#, automating client verification and risk assessment. Created the frontend with Angular and TypeScript, collaborating with analysts and product owners to meet project requirements.",
          "Architected and developed an Azure-hosted SaaS client scoring application in C#. Developed the frontend application using Angular and TypeScript, while creating and managing build pipelines and IaC in Terraform to ensure seamless deployment and high performance."
        ]
      },
      {
        "role": "REGULAR SOFTWARE ENGINEER (C#/C++)",
        "company": "Order Group sp. z o.o.",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2016 - 2018",
        "responsibilities": [
          "Architected and developed a mobile application for iOS and Windows designed to aid both helicopter and aircraft pilots during all types of flight operations using C#. Through close collaboration with clients, ensured the application met their requirements and provided the best solutions while also optimizing memory and CPU/GPU performance to improve device stability and battery life.",
          "Developed an application in C# that manages and synchronizes user receipts for SKANSKA. Implemented a system that accurately identified receipt data while also developing a user interface based on provided mockups to ensure ease-of-use for users."
        ]
      },
      {
        "role": "REGULAR SOFTWARE ENGINEER (C#)",
        "company": "Fuero Games sp. z o.o.",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2014 - 2016",
        "responsibilities": [
          "Developed a cross-platform MMO strategy game for iOS, Android, and Facebook using C#. Implemented optimizations that enhanced network performance by leveraging prediction and request batching, while also integrating external payment providers such as Xsolla, Google Play, and the App Store to provide seamless payment options to users.",
          "Developed a PoC multiplayer third-person desktop shooter in C# for Wargaming, implemented network synchronization and replication components to create a seamless and engaging gaming experience. Ensured that the PoC met all requirements and exceeded expectations."
        ]
      },
      {
        "role": "JUNIOR SOFTWARE DEVELOPER (C#/JAVASCRIPT)",
        "company": "Nitreal",
        "location": "Poland, Warsaw",
        "summary": "",
        "period": "2013 - 2014",
        "responsibilities": [
          "Ported a suite of leading company products from legacy technology to the Unity 3D platform, delivering improved performance and enhancing the user experience successfully bringing a series of popular time management strategy games from PC to mobile.",
          "Created a comprehensive framework in JavaScript to support the development of interactive, educational games. Utilizing this framework, developed twenty engaging educational games designed to engage and entertain users while also promoting learning and knowledge retention."
        ]
      }
    ],
    "contribution": [
      {
        "period": "2017 - present",
        "url": "quantform.io",
        "responsibilities": [
          "Created an open-source Node.js library in TypeScript for building reactive algorithmic trading strategies using RxJS. Designed an interface for both centralized and decentralized exchanges, and built tools for strategy execution and management. Also prepared technical documentation and a landing page."
        ]
      },
      {
        "period": "2023 - present",
        "url": "reth.rs",
        "responsibilities": [
          "Contributed to blazing-fast implementation of the Ethereum protocol to gain knowledge about ethereum nodes and learn Rust."
        ]
      },
      {
        "period": "2022 - 2022",
        "url": "pepperoni.finance",
        "responsibilities": [
          "Developed a Web 3.0 project that enables easy portfolio asset rebalancing on the Ethereum blockchain using Uniswap protocol, with a design inspired by the Uniswap App powered by Next.js, React, and hosted on Vercel."
        ]
      },
      {
        "period": "2016 - 2017",
        "summary": "startup",
        "responsibilities": [
          "Developed a secure messaging mobile application using Kotlin, implementing end-to-end encryption and a hierarchical deterministic Bitcoin wallet. The communication protocol was built on top of the Bitcoin blockchain, ensuring top-notch security for users."
        ]
      },
      {
        "period": "2015 - 2016",
        "url": "github.com/majchrzak/flurry-unity-3d",
        "responsibilities": [
          "Developed a Yahoo Flurry Analytics plugin for Unity 3D in multiple languages such as C#, Java, and Objective-C, which enabled developers to easily integrate analytics into their Unity-based mobile games. The plugin was officially recognized by Yahoo and listed as a third-party provider on their documentation."
        ]
      },
      {
        "period": "2014 - 2015",
        "url": "github.com/majchrzak/storekit-unity-3d",
        "responsibilities": [
          "Created an Apple StoreKit plugin for Unity 3D that allows developers to easily add in-app purchase functionality to their iOS games. With features such as secure transaction handling, receipt validation, and subscription management, the plugin simplifies the process of monetizing games on the App Store."
        ]
      }
    ],
    "certification": [],
    "skills": [
      "DDD",
      "TDD",
      "TypeScript",
      "Node.js",
      "C#",
      ".NET Core"
    ],
    "language": [
      {
        "name": "Polish",
        "summary": "Native proficiency"
      },
      {
        "name": "English",
        "summary": "Upper-intermediate proficiency"
      }
    ],
    "clause": "I agree to the processing of personal data provided in this document for realising the recruitment process pursuant to the Personal Data Protection Act of 10 May 2018 (Journal of Laws 2018, item 1000) and in agreement with Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation)"
  }
}