{
    "profile": {
        "overview": {
            "name": "Mateusz Majchrzak"
        },

        "experience": [
            {
                "role": ".NET Senior Developer",
                "company": "ITMAGINATION  sp. z o.o.",
                "location": "(remote)",
                "summary": "",
                "responsibilities": [
                    "Developed, designed and advised trading platform with aggregates exchanges located around the world to generate passive income; designed several trading strategies i.a. arbitrage, market making, hedge, relative value; working with data teammates to optimize, backest and improve algorithms; managing fund portfolio;",
                    "Developed Know Your Customer web application which automates verifying the identity of clients and assessing potential risks of illegal intentions for the business relationship for BNP Paribas;"
                ]
            },
            {
                "role": ".NET/C++ Senior Developer",
                "company": "Order Group  sp. z o.o.",
                "location": "Warsaw",
                "summary": "",
                "responsibilities": [
                    "Developed mobile navigation used by Polish Medical Air Rescue and Polish Air Force University pilots for iOS and UWP; this product competes with Jeppesen Aviator owned by Boeing; designed application architecture; adopted and extended Tangram-ES map rendering library; build product backlog items;"
                ]
            },
            {
                "role": ".NET Regular Developer",
                "company": "Freelance",
                "location": "Warsaw",
                "summary": "",
                "responsibilities": [
                    "Developed secure decentralized messaging application for Android; designed end-to-end communication protocol based on Bitcoin network; developed another one Bitcoin wallet;",
                    "Developed e-commerce platform clients for iOS and Android; designed user interface based on website;"
                ]
            },
            {
                "role": "Unity 3D Developer ",
                "company": "Fuero Games",
                "location": "Warsaw",
                "summary": "",
                "responsibilities": [
                    "Deﬁning and creating a communication protocol built on top of blockchain technology.",
                    "Designing and developing secure token authentication client.",
                    "Implementing end-to-end data encryption based on Elliptic Curves.",
                    "Developing hierarchical deterministic Bitcoin wallet.",
                    "Designing and developing user interface (AXML).",
                    "Participating in testing and bug ﬁxing processes."
                ]
            }
        ],

        "contribution": [
            {
                "role": "Software Developer",
                "company": "ITMAGINATION  sp. z o.o.",
                "location": "(remote)",
                "summary": "",
                "responsibilities": [
                    "Developing processes which automates verifying the identity of clients and assessing potential risks of illegal intentions for the business relationship.",
                    "Developed automotive application for iOS and Android"
                ]
            }
        ],

        "skills": [
            "DDD",
            "TDD",
            "C#",
            ".NET Core",
            ".NET Framework",
            "Xamarin",
            "Unity 3D",
            "Angular 2",
            "TypeScript",
            "CSS",
            "SCSS",
            "HTML",
            "RxJS",
            "Dart",
            "Flutter",
            "SQL Server",
            "PostgreSQL",
            "MongoDb",
            "Docker",
            "AWS",
            "Azure DevOps",
            "RabbitMQ",
            "Git",
            "SCRUM",
            "Visual Studio",
            "VSCode",
            "Rider"
        ]
    }
}